Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: དེ་ནས་ཡང་བདུད་སྡིག་ཅན་རབ་ཏུ་ཁྲོས་ཤིང་སྡུག་བསྔལ་ཏེ་ཡིད་མི་བདེ་ཞིང་ཡིད་ལ་གཅགས་ནས་ངུ་ཞིང་སྐད་ཆེན་པོས་རང་གི་བུ་དང་ཚོགས་ཀྱི་འཁོར་ལ་བོས་ཏེ་བདུད་ཀྱི་གནས་ཐམས་ཅད་སྒྲས་གང་བར་བྱས་སོ།
en: The evil Māra then became even more unhappy, dejected, and sullen. Crying, he bellowed in a forceful voice to the hosts of his sons along with their retinues, engulfing the entire abode of Māra with these words: “Come here, dear children, along with your retinues!

source: །སྡུག་པའི་བུ་དང་ཚོགས་ཀྱི་འཁོར་རྣམས་ཚུར་ཤོག་ཤིག །ང་ནི་བདག་ཡུལ་རང་གི་རྫུ་འཕྲུལ་སྟོབས་ལས་ཉམས།
en: We are being banished from our domains and deprived of our strength and magical powers. Born in this world, with a nature like a poisonous tree,

source: །ཤཱཀྱའི་བུ་འདི་སྒྱུ་ལྡན་གཡོ་ཅན་ངག་འཇམ་ལ། །ཁོང་ནས་རང་བཞིན་དུག་སྡོང་འདྲ་བ་འདིར་སྐྱེས་སོ།
en: The son of the Śākyas is a sweet-talking deceiver.”

source: །དེ་ནས་སྒྲ་དེས་བདུད་ཀྱི་གཡོག་མོ་དང་། བདུད་ཀྱི་བུ་མོ་དེ་དག་ཐམས་ཅད་དང་། བདུད་ཀྱི་བུ་ཚོགས་ཀྱི་འཁོར་དང་བཅས་པ་ཐམས་ཅད་རིངས་པའི་གཟུགས་ཀྱིས་མྱུར་དུ་ལྷགས་ནས།
en: At these words, all of Māra’s daughters and servant girls, as well as all his sons with their retinues, making haste, swiftly approached and stood in front of Māra, the evil one. There was in that gathering a son by the name Jayamati.

source: བདུད་སྡིག་ཅན་གྱི་མདུན་དུ་འཁོད་པ་དང་། འཁོར་དེའི་ནང་ནས་བདུད་ཀྱི་བུ་རྒྱལ་བའི་བློ་གྲོས་ཞེས་བྱ་བ་དེས་ཐལ་མོ་སྦྱར་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: With folded hands he inquired:

source: །ཅི་སླད་ཐུགས་ཁྲོས་རབ་ཏུ་འཁྲུགས་ཤིང་ཐུགས་མི་དགྱེས།
en: “Why are you so sad, with your mind so dejected and infuriated?

source: །བསྲེག་བསྐལ་དེང་འདིར་མ་བྱུང་འདི་ནས་ཁྱོད་མ་འཕོས།
en: There is no fire here, like at the end of an eon, nor are you passing from here.

source: །འདི་ན་ཁྱོད་ལྷག་དགྲ་ནི་སུ་ཡང་མ་མཆིས་ན།
en: You have no enemy that is rising to power. Why are you so confused?

source: །ཁྱོད་ཅི་རྨོངས་པར་གྱུར་ཏམ་ཅི་སླད་གཞན་དུ་དགོངས།
en: Why are you so preoccupied about someone else?”

source: ཤཱཀྱའི་བུ་ཕོ་དམངས་ཕལ་ཤིང་གི་གྲིབ་མ་འདུག་པ་མ་མཐོང་ངམ།
en: “Don’t you see the son of the Śākyas sitting in the shade of the commoners’ tree?

source: །ཅི་ཕྱིར་འདི་ན་ཁྱོད་ཀྱི་མདུན་ན་སྟོབས་དང་ལྡན་པའི་དགྲ་མེད་སྨྲས།
en: Then why do you say here in front of me that I have no powerful enemy?

source: །སྟོབས་གཅིག་ལྡན་པ་གཡོ་ཅན་དེ་ཡིས་ཐམས་ཅད་རྣམ་པ་དུ་མར་བསླུས།
en: That powerful rogue has misled everybody in various ways.

source: །བདག་ཅག་བུ་དང་སྡེར་བཅས་མེ་ལྕེ་འབར་དང་བཅས་པའི་མེ་ཡིས་བསྲེགས།
en: Because of that we and our sons and legions are scorched by fire with flaming tongues.

source: །འཇིག་རྟེན་འདི་ན་སྐྱེས་བུ་གཙོ་བོ་དཔལ་དང་བརྗོད་པ་རྣམ་གྲགས་པ།
en: “The most prominent people of this world, whose fame and glory are widely celebrated,

source: །མཁས་པ་བསྟན་བཅོས་སྙན་དངགས་མང་པོ་བྱེད་བརྩོན་འཐུན་པར་མྱུར་བར་ཡང་།
en: Learned people who study and excel in sciences, poetry, and composition,

source: །ཆོས་ཀྱི་ཀྱོ་བ་ཏང་གིས་དྲངས་ཏེ་ཤཱཀྱའི་བུ་འདིའི་སྐྱབས་དེང་སོང་།
en: Have readily taken refuge in the son of the Śākyas, pulled in by the Dharma hook he casts.

source: །ལུས་མཛེས་གཡོ་ཅན་བློ་གྲོས་ལྡན་འདི་ང་ཡི་དགྲར་ནི་རབ་ཏུ་གནད།
en: Thus this enemy of mine, attractive in body but wicked in mind, has gained in prominence.

source: །རབ་ཏུ་སྡུག་པའི་གཡོག་མོ་དེ་དག་སྙིང་རྗེ་མེད་པས་ང་བོར་ཏེ།
en: “Even my beloved retinue, having heartlessly abandoned me

source: །ང་ལ་དཔང་བཙུགས་ནས་ནི་དེ་རིང་དགེ་སྦྱོང་དེ་ཡི་སྐྱབས་སུ་དོང་། །གལ་ཏེ་བདག་ཅག་མྱུར་བསྒྲིམས་སྟོབས་ཆེན་འདི་དེང་ཐལ་བར་མ་བྱས་ན།
en: After being entrusted to me, have now taken refuge in that monk.

source: །གཡོ་དང་སྒྱུ་ཡིས་སྲིད་པ་གསུམ་པོ་དེ་དག་མ་ལུས་སྟོངས་པར་བྱེད།
en: That rogue will empty the entire threefold universe with his magic If we don’t reduce him to ashes here and now by using force and acting quickly.”

source: །དེ་ནས་བདུད་ཀྱི་བུ་ཚོགས་ཀྱི་འཁོར་དང་བཅས་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཐལ་མོ་སྦྱར་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: All the sons of Māra with their numerous retinues folded their hands and promised, “We will do it.

source: །དེ་ལྟར་བགྱིའོ། །བདག་ཅག་གིས་རྫུ་འཕྲུལ་དང་། སྟོབས་ཀྱི་ཡུལ་གྱི་མཐུ་དང་། རྣམ་པར་སྤྲུལ་པ་དེ་དག་ཐམས་ཅད་བསྟན་ཏེ།
en: What we can do is put on a display of our magical powers, strength, dominion, authority, and miracles.

source: ཤཱཀྱའི་བུ་འདི་གལ་ཏེ་ཐལ་བར་བགྱིད་ནུས་པ་དེ་ལྟ་ན་ནི་ལེགས།
en: If we are able to turn the son of the Śākyas to ashes, that’s good.

source: དེ་ལྟར་མ་ནུས་ན་ནི་དེ་ལ་སྐྱབས་སུ་མཆིའོ།
en: If we are unable to, we shall take refuge in him.

source: །ཡབ་ཉིད་ཀྱི་མངོན་སུམ་དུ་གྱུར་པ་ལགས་ཏེ། གང་བདག་ཅག་སྡེ་ཆེན་པོས་ཡོངས་སུ་བསྐོར་བ་སྔར་ཤཱཀྱའི་བུ་གཅིག་པུ་གཉིས་སུ་མེད་པ་འདིས་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་རབ་ཏུ་ཕམ་པར་བགྱིས་ན་ད་གཡོག་མང་པོར་གྱུར་པ་ལྟ་ཅི་སྨོས།
en: You yourself, O Father, have witnessed that we, surrounded by our huge army, have previously been defeated by the son of the Śākyas acting alone, without a companion, using merely his magical powers. What then can we expect if he is surrounded by his followers?”

source: བདུད་སྡིག་ཅན་གྱིས་སྨྲས་པ།
en: Māra , the evil one, replied, “You should go anyway, my good sons!

source: བཞིན་བཟངས་དག་དེང་ལ་གལ་ཏེ་དགེ་སྦྱོང་གཽ་ཏ་མ་འདི་གསོད་ནུས་ན་སླར་ཤོག་ཤིག །ཅི་སྟེ་མ་ནུས་ན་ཡང་བདག་ཅག་གི་གནས་ཀྱང་བསྲུང་གིས་སླར་ཤོག་ཤིག །དེ་ནས་བདུད་ཀྱི་འཁོར་དཀྲིགས་ཕྲག་བཅུ་གཉིས་པོ་དེ་དག་དེ་ནས་འཕགས་ཏེ།
en: If you manage to kill that monk Gautama, come back again. If you can’t manage this, you should still return, as we will have to defend our abode.”

source: འདི་ནས་སྟེང་དུ་དཔག་ཚད་བརྒྱད་ཁྲི་བཞི་སྟོང་གི་བར་དུ་བཀང་ནས་དེ་འདྲ་བའི་བདུད་ཀྱི་སྟོབས་ཀྱི་ཡུལ་གྱི་རྫུ་འཕྲུལ་དྲག་པོ་བསྟན་ཏེ།
en: Then Māra’s twelve trillion attendants, in a formation stretching upward for more than three hundred and twenty leagues and spreading over an area of thousands of leagues, displayed the magical power and speed of Māra’s army.

source: གང་གླིང་བཞི་པའི་ནམ་མཁའ་ཐམས་ཅད་སྤྲིན་ནག་པོ་ཆེན་པོ་དང་། རླུང་ནག་པོ་ཆེན་པོ་དང་། སྐར་མདས་བཀང་ནས་རིའི་རྒྱལ་པོ་རི་རབ་ལ་ཡང་ལག་གིས་བརྡབས་ཏེ། གླིང་བཞི་པ་ཐམས་ཅད་རབ་ཏུ་གཡོས་པར་བྱས་ནས་ཤིན་ཏུ་འཇིགས་པའི་སྒྲ་རྣམས་ཀྱང་འབྱིན་ཏོ།
en: They filled the entire space over the four continents with thick black clouds and struck the king of mountains, Sumeru, with their hands, releasing black tornadoes and lightning bolts and making all the four continents shake violently. They uttered the most terrifying cries.

source: །དེ་དག་གིས་ཀླུ་དང་། ཀླུ་ཆེན་པོ་དང་། གནོད་སྦྱིན་དང་། གནོད་སྦྱིན་ཆེན་པོ་དག་གིས་ས་ཆེན་པོ་བྲག་དང་རིར་བཅས་པ་ཐམས་ཅད་དང་ལྡན་པ། རིའི་རྒྱལ་པོ་རི་རབ་ཀྱང་གཡོས་པར་རིག །མཚོ་དང་། མཚོ་ཆེན་པོ་དང་། འབབ་ཆུ་དང་། ཆུ་བྲན་དང་། འབབ་ཆུ་ཆེན་པོ་དང་། རྒྱ་མཚོ་ཆེན་པོ་རྣམས་ཀྱང་འཁྲུགས་པར་རིག་ནས་ནམ་མཁའི་དཀྱིལ་ན་འཁོད་དོ།
en: Subsequently, the nāgas, great nāgas, yakṣas, and great yakṣas assembled in the sky when they witnessed that the entire great earth with its rocks, mountains, and mountain ranges—including even Sumeru, the king of mountains—was quaking, and that the lakes, great lakes, rivers great and small, and the great oceans were churning.

source: །བདུད་ཀྱི་འཁོར་དེ་དག་ནི་རི་རབ་ཀྱི་ཟོམ་ལ་འཁོད་ནས།
en: The great assembly of Māra ’s followers stood on top of Mount Sumeru, conjured up rain pellets one league in size, and released them onto the country of Aṅga-Magadha.

source: དཔག་ཚད་ཙམ་གྱི་རྡོའི་ཆར་མངོན་པར་སྤྲུལ་ཏེ་ནམ་མཁའ་ལས་ཀུན་ཏུ་འབེབས་སོ། །རལ་གྲི་དང་། གཏུན་ཤིང་དང་། རྡོ་བ་དང་། མཚོན་རྩེ་གཉིས་དང་། སྟེའུ་ཀ་མ་དང་། ལྕགས་མདའ་དང་། སྤུ་གྲི་དང་། སྤུ་གྲི་ལྟ་བུ་དང་། དགྲ་སྟ་དང་། སྟེའུ་སོ་ལྟ་བུ་དང་། སྟེའུ་སོ་དང་། ཁ་རད་རོད་ཅན་དང་། ཁ་ཤིན་ཏུ་རད་རོད་ཅན་དང་། སྲ་བ། དྲག་པ། རྩུབ་པ། རྣོ་བའི་ཆར་རབ་ཏུ་སྤྲུལ་ཏེ་ཀུན་ཏུ་ཕབ་པོ།
en: They also conjured up and released a great rain of swords, clubs, stones, lances, javelins, razor blades, razors mounted on objects, razor-like objects, adzes mounted on objects, adze blades, and terrible wheels armed with teeth—a downpour of solid, hard, rough objects.

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་བདུད་ཀྱི་འཁོར་རྣམ་པར་འཇིག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ཏེ།
en: At this time, the Blessed One entered the absorption grinding the hosts of Māra

source: གང་རྡོ་དང་། མཚོན་ཆ་དེ་དག་ཐམས་ཅད་ནི་ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དང་། མན་དཱ་ར་བ་དང་། མན་དཱ་ར་བ་ཆེན་པོའི་མེ་ཏོག་གི་ཆར་ཆེན་པོར་བྱིན་གྱིས་བརླབས། ཡུལ་ཨང་ག་མ་ག་དྷཱར་སྐར་མདའ་ལྟུང་བ་ནི་སྤོས་ཀྱི་ཆར་ཆེན་པོར་བྱིན་གྱིས་བརླབས། སྒྲ་དེ་ནི་རོལ་མོའི་སྒྲ་སྣ་ཚོགས་སུ་བྱིན་གྱིས་བརླབས་ཏེ། འདི་ལྟར་སངས་རྒྱས་ཀྱི་སྒྲ་དང་། ཆོས་ཀྱི་སྒྲ་དང་། དགེ་འདུན་གྱི་སྒྲ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒྲ་དང་། མངོན་པར་ཤེས་པའི་སྒྲ་དང་། ཕྱིར་མི་ལྡོག་པའི་སྒྲ་དང་། དབང་བསྐུར་བའི་སྒྲ་དང་། བདུད་བཞི་ཕམ་པར་བྱ་བའི་སྒྲ་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བའི་སྒྲ་དང་། ལེན་པ་དང་བཅས་པ་དང་། ལེན་པ་མེད་པའི་སྒྲར་བྱིན་གྱིས་བརླབས་སོ།
en: Through its blessing power the whole rain of stones and weapons turned into a rain of celestial flowers, such as lotuses and water lilies in white, red, and blue varieties and flowers of the coral tree and the great coral tree. He also transformed through his blessing all the different yells and noises into melodious sounds, the sounds of the Buddha, the Dharma, the Saṅgha, the perfections, the superknowledges, the state of not turning back, consecration, victory over the four māras, going to the seat of awakening, . . . the state of clinging to existence, and the state without clinging.

source: །རྡུལ་དང་། མུན་ནག་དང་། རླུང་ཐམས་ཅད་ཀྱང་རབ་ཏུ་ཞིའོ།
en: All the wind, darkness, and dust settled down.

source: །གང་གླིང་བཞི་པ་འདི་ན་རྩྭ་དང་། ཤིང་གེལ་པ་དང་། སྨན་དང་། ནགས་ཚལ་དང་། ས་དང་། བྲག་དང་། རི་ཅི་ཡོད་པ་དེ་དག་ཐམས་ཅད་ནི་རིན་པོ་ཆེ་སྣ་བདུན་དུ་བྱིན་གྱིས་བརླབས་སོ། །བཅོམ་ལྡན་འདས་གཙུག་ཏོར་བལྟར་མི་མཐོང་བ་དང་ལྡན་པ་ནི་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་སྐུས་དབང་མཛད་དོ།
en: All the grasses, bushes, herbs, trees, soil, rocks, and mountains—whatever there were in the four continents—turned into the seven precious gems by the power of his blessing. The Blessed One, endowed with an uṣṇīṣa that is not fully visible, extended his control by means of his body as far as the realm of Brahmā

source: །བཅོམ་ལྡན་འདས་ཀྱི་མཚན་རེ་རེ་ལས་ཀྱང་འདི་འདྲ་བའི་འོད་བྱུང་སྟེ། འོད་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ།
en: From each of the Blessed One’s major marks a light issued forth of such a kind that the world spheres of the great trichiliocosm became clearly and distinctly visible, illuminated by their great radiance.

source: །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། ཡི་དགས་དང་། ཤ་ཟ་དང་། གྲུལ་བུམ་དང་། མི་དང་། མི་མ་ཡིན་པ་དང་། སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་པ་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་བཅོམ་ལྡན་འདས་མཐོང་ནས།
en: And whatever gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, pretas, piśācas, kumbhāṇḍas, humans, nonhuman beings, animals, and denizens of the hells and the realms of Yama there were in the great trichiliocosm, all were able to see the Blessed One.

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་ས་དང་ནམ་མཁའ་ལ་འཁོད་པ་བརྒྱ་སྟོང་མང་པོས་ནི་མེ་ཏོག་གཏོར་ཅིང་བསྟོད་ནས་བསྐོར་བ་བྱས་སོ། །སེམས་ཅན་དམྱལ་བ་པ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་པ་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་པ་མི་འཁྲུགས་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་ནི་དྲན་པ་རྙེད་དེ།
en: Many hundreds of thousands of gods, nāgas, yakṣas, and human and nonhuman beings arrayed in the sky threw flowers, circumambulated the Blessed One clockwise, praised him, and bowed to him. Many hundreds of thousands of millions of hell beings, animals, and denizens of Yama’s realms attained recollection.

source: དགེ་བའི་རྩ་བ་སྔོན་བསྐྱེད་པ་དྲན་ནས་སངས་རྒྱས་ལ་ཕྱག་འཚལ་ལོ་ཞེས་བྱས་ཏེ། ངན་སོང་དེ་དག་ནས་ཤི་འཕོས་ནས་ལྷར་སྐྱེས་སོ།
en: Recollecting the roots of virtue planted in former lives, they chanted, “Homage to the Buddha!” Having died and transmigrated from the lower realms, they were reborn as gods.

source: །བདུད་ཀྱི་སྡེ་དེའི་ནང་ནས་བདུད་ཀྱི་བུ་ཉི་ཁྲིའི་ཚོགས་ཀྱི་འཁོར་དང་བཅས་པས་བཅོམ་ལྡན་འདས་ཀྱི་ཆོ་འཕྲུལ་ཆེན་པོ་འདི་ལྟ་བུ་མཐོང་ནས། བཅོམ་ལྡན་འདས་ལ་རབ་ཏུ་དགའ་བར་གྱུར་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་ནས་ཕྱིན་པ་དང་། བདུད་ཀྱི་བུ་མོ་ལྔ་བརྒྱ་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: Twenty-two hundred thousand of the soldiers of Māra , along with their numerous retinues, witnessed this display of miracles by the Blessed One and developed deep faith in his presence. They approached him accompanied by the five hundred daughters of Māra

source: ཐལ་མོ་སྦྱར་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །རྣམ་དག་སྐུ་མངའ་མཆོག་ཏུ་གཟུགས་བཟང་བ།
en: Together they bowed their heads to the Blessed One’s feet and with folded hands uttered these stanzas for him: “O you with a pure and supremely beautiful form,

source: །ཡེ་ཤེས་རྒྱ་མཚོ་གསེར་གྱི་ལྷུན་པོ་འདྲ།
en: You are an ocean of wisdom, you are like a golden Mount Sumeru!

source: །གྲགས་པ་འཇིག་རྟེན་བཀྲམ་ནས་ལྷམ་མེ་བ།
en: Your shining fame spreads throughout the world.

source: །མགོན་པོ་ཁྱོད་ཉིད་ལ་ནི་སྐྱབས་སུ་མཆི།
en: To you, our protector, we go for refuge.

source: །རབ་ཏུ་ལམ་སྟོར་རྣམ་པར་མིག་ཟུམས་ལ།
en: “For those who have lost the way and whose eyes are closed,

source: །ཁྱོད་ནི་འཇིག་རྟེན་སྒྲོན་མ་ཉི་མ་འདྲ།
en: You brightly shine your guiding light, like the sun in this world.

source: །གཞན་གྱིས་མི་ཐུབ་སྲོག་ཆགས་རྩ་ལག་གཅིག །དེད་དཔོན་ཁྱོད་ལ་སྐྱབས་སུ་རབ་ཏུ་མཆི།
en: You are a unique kinsman, an unconquerable supporter of life. To you, our leader, we go for refuge.

source: །ཤིན་ཏུ་ཚོགས་བསགས་ཡེ་ཤེས་འབྱོར་པའི་མཛོད།
en: “You have auspiciously gathered the accumulations and are a treasury rich with wisdom.

source: །ནམ་མཁའི་རང་བཞིན་གཟོད་ནས་རྣམ་གྲོལ་ཐུགས།
en: Having the nature of space, your mind is originally free.

source: །ཐུགས་རྗེ་བསམ་པ་ཡིད་འོང་འཇམ་པའི་གསུང་།
en: Your heart is filled with compassion, and your lovely speech captivates the mind.

source: །དོན་ཀུན་གྲུབ་པ་ཁྱོད་ལ་སྐྱབས་སུ་མཆི།
en: To you, who accomplishes all purposes, we go for refuge.

source: །འཁོར་བའི་དགོན་པ་ལས་ནི་ཁྱོད་ཐར་མཛད།
en: “You deliver beings from the wasteland of saṃsāra,

source: །ཚོགས་པ་ལས་ཀྱང་རྒྱུ་དང་འབྲས་བུ་སྟོན།
en: Showing them the causes and results of accumulated action.

source: །བྱམས་ལ་གནས་ཤིང་མཆོག་གི་ཆོ་ག་མཁྱེན།
en: Knowing the supreme method, you live the life of loving kindness.

source: །ཐུགས་རྗེ་གནས་པའི་སྐྱབས་སུ་རབ་ཏུ་མཆི།
en: To you, who lives the life of compassion, we go for refuge.

source: །སྒྱུ་མ་སྨྱིག་རྒྱུ་ཆུ་ཟླ་འདྲ་བ་ཡི།
en: “In this existence, illusory as the moon reflected in water,

source: །སྲེད་པ་ལ་ནི་ཡུལ་གྱི་གནས་ཀྱིས་ཆགས།
en: With your senses unattached to objects,

source: །མི་ཤེས་ནད་སེལ་འཇིག་རྟེན་རྣམས་ཀྱི་མགོན།
en: You destroy, O protector of the world, the disease of ignorance.

source: །སྨན་པའི་རྒྱལ་པོ་ཁྱོད་ལ་སྐྱབས་སུ་མཆི།
en: To you, the king of physicians, we go for refuge.

source: །ཆུ་བོ་བཞི་དབུས་ཟམ་པར་གྱུར་པ་ཁྱོད།
en: “You serve as a bridge, saving beings from the midst of the four rivers

source: །ནོར་བདུན་འཕགས་པའི་ཚུལ་གྱིས་རབ་སྒྲོལ་བ།
en: By means of the seven spiritual treasures practiced by the noble ones.

source: །ཡང་དག་ལམ་སྟོན་འཇིག་རྟེན་རྩ་ལག་པོ།
en: You show the right path, O kinsman of the world!

source: །ཐུགས་རྗེ་ལྡན་པ་ཁྱོད་ལ་འདིར་མཆོད་དོ།
en: We worship you, the compassionate one in this world. “As we were nasty to you, a being of superior intelligence,

source: །བློ་མཆོག་ཁྱོད་ལ་བདག་ཅག་བཟོད་པར་གསོལ།
en: We now ask your forgiveness.

source: །ཁྱོད་ལ་བདག་ཅག་ཡིད་ཀྱིས་གནོད་བསམས་པ། །མགོན་པོ་དཔའ་བོས་ནོངས་པ་བཟོད་པར་གསོལ།
en: Receiving such insults like a hero, O protector,

source: །ཁྱོད་ནི་འགྲོ་བའི་རྩ་ལག་གཅིག་པུ་གཙོ།
en: You are a unique kinsman, the best in the world.

source: །བདག་ཅག་བདུད་ཀྱི་ཕྱོགས་རྣམས་རབ་སྤངས་ཏེ།
en: “Having now repelled the faction of Māra

source: །བྱང་ཆུབ་མཆོག་གི་སེམས་ནི་བསྐྱེད་པར་བགྱི།
en: We give rise to the supreme mind of awakening.

source: །སེམས་ཅན་མ་ལུས་ཐམས་ཅད་མགྲོན་དུ་གཉེར།
en: We invite all beings, as we pledge

source: །བདག་ཅག་གིས་ནི་བྱང་ཆུབ་མཆོག་ཐོབ་བགྱི།
en: To attain supreme awakening for their sake.

source: །ཅི་ནས་བདག་ཅག་ཕ་རོལ་ཕྱིན་སྤྱོད་པར།
en: “Please teach us the noble conduct

source: །བདག་ཅག་རྣམས་ལ་སྤྱོད་པ་རྒྱ་ཆེར་སྟོན།
en: Whereby we can practice the perfections,

source: །གཞན་མ་ཡིན་གསུང་ཆོས་ནི་དུ་རྣམས་དང་། །ལྡན་ན་བྱང་ཆུབ་རབ་ཏུ་ཐོབ་པར་འགྱུར།
en: Since beings attain awakening when endowed With qualities taught by none other.

source: །མེ་ཏོག་གང་གིས་ཁྱོད་ལ་མངོན་གཏོར་བ།
en: “May the flowers that we cast forth remain, as parasols, Above the heads of the best among the two-legged creatures

source: །ཕྱོགས་ཀུན་དུ་ཡང་དེ་དག་གདུགས་གྱུར་ཏེ།
en: In the buddha fields in all directions,

source: །དུས་ཀུན་བདེ་བའི་འབྱུང་གནས་ཞིང་དུ་ནི།
en: So that these fields may be sources of pleasure in all seasons.”

source: །རྐང་གཉིས་མཆོག་གི་སྤྱི་བོར་འདུག་གྱུར་ཅིག །དེ་ནས་བདུད་ཀྱི་བུ་མོ་དེ་དག་དང་། བདུད་ཀྱི་བུ་ཚོགས་ཀྱི་འཁོར་དང་བཅས་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་མེ་ཏོག་སིལ་མ་གཏོར་བ་དང་། མེ་ཏོག་སིལ་མ་དེ་དག་བཅོམ་ལྡན་འདས་ཀྱི་རྫུ་འཕྲུལ་གྱི་མཐུས།
en: All the sons and daughters of Māra , together with their numerous retinues, then sprinkled flowers over the Blessed One.

source: གང་གཱའི་ཀླུང་གི་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གི་བྱེ་མ་ལས་འདས་པའི་མེ་ཏོག་གི་གདུགས་ཀུན་ཏུ་འདུག་པར་གྱུར་ཏེ།
en: Through the Blessed One’s magical power, however, the scattered flowers turned into many thousands of millions of billions of flower parasols, exceeding in number even the sand grains in the Gaṅgā.

source: མེ་ཏོག་གི་གདུགས་དེ་དག་ཀྱང་ཕྱོགས་བཅུའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཞུགས་ཤིང་འཚོ་ལ་གཞེས་པ་ཐམས་ཅད་ཀྱི་དབུའི་གཙུག་གི་དྲང་ཐད་ཀྱི་སྟེང་གི་བར་སྣང་ལ་འདུག་གོ།
en: The flower parasols remained in midair above the crowns of the heads of all the living buddhas in the ten directions.

source: །བདུད་ཀྱི་བུ་མོ་དེ་དག་དང་། བདུད་ཀྱི་བུ་ཚོགས་ཀྱི་འཁོར་དང་བཅས་པ་དེ་དག་གིས་ཀྱང་སོ་སོ་ནས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་དཔག་ཏུ་མེད་པ་ཐམས་ཅད་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཞུགས་ཤིང་འཚོ་ལ་གཞེས་ཏེ། ཆོས་ཀྱང་འཆད་པ་འཁོར་གྱིས་ཡོངས་སུ་བསྐོར་ཏེ། ལྷམ་མེ། ལྷན་ནེ། ལྷང་ངེར་བཞུགས་དཔའི་དབུའི་གཙུག་གི་དྲང་ཐད་ཀྱི་སྟེང་གི་བར་སྣང་ལ་མེ་ཏོག་གི་གདུགས་དེ་དག་འདུག་པར་གྱུར་པ་མཐོང་ཞིང་།
en: The daughters of Māra with their retinues beheld these flower parasols positioned above the crowns of the heads of the living blessed buddhas, who were expounding the Dharma, surrounded by their followers, in innumerable and infinitely vast buddha fields in every direction. They were all sitting down, resplendent with light.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་ཁ་དོག་མཚུངས་པ། རྟགས་མཚུངས་པ། གཟུགས་མཚུངས་པར་སྣང་བ་ཤ་སྟག་ལ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་སེང་གེའི་ཁྲི་ཐ་དད་ཅིང་འཁོར་ཐ་དད་ལ། སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པའི་ཉི་ཚེ་ཐ་དད་པར་མཐོང་སྟེ།
en: They all had the same color, attributes, form, and appearance. The only differences that the daughters could see were among the individual lion thrones of these blessed buddhas, their retinues, and the marvelous characteristics of their individual buddha fields.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་གྱི་གསུང་བརྗོད་པ་ནི་མ་ཐོས་སོ།
en: They also heard the stanzas recited by the blessed buddhas to the sound of lutes.

source: །བདུད་ཀྱི་འཁོར་དེ་དག་བཅོམ་ལྡན་འདས་ཀྱི་འདི་ལྟ་བུའི་ཆོ་འཕྲུལ་མཐོང་ནས་མཆོག་ཏུ་དགའ་བ་དང་མོས་པ་སྐྱེས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ཆོས་མཉན་པའི་ཕྱིར་སྤྱན་སྔར་འཁོད་དོ།
en: And so this retinue of Māra , having seen such a miraculous display through the power of the Blessed One, developed strong faith. They bowed their heads to his feet and sat down in front of him to listen to the Dharma.

source: །དེ་ནས་བདུད་ཀྱི་བུ་ཚོགས་ཀྱི་འཁོར་དང་བཅས་པ་དེ་དག་ལས་དཀྲིགས་ཕྲག་བཅུ་ཕྱིར་ལོག་ནས། བདུད་ཀྱི་གནས་སུ་དེ་ལྟ་བུའི་ངོ་མཚར་བདུད་སྡིག་ཅན་ལ་རྒྱ་ཆེར་བཟླས་ཏེ།
en: However, from among Māra ’s sons, along with their retinues, ten trillion returned back to Māra ’s abode and relayed to Māra , the evil one, this detailed account:

source: དགེ་སྦྱོང་གཽ་ཏ་མ་དེ་ཡི་བ་སྤུའི་ཁུང་བུ་གཅིག་ཀྱང་བདག་ཅག་གིས་གཞིག་པར་མ་ནུས་ན་གསད་པར་ལྟ་ཅི་སྨོས། དེའི་སྟེང་དུ་ཉི་ཁྲི་དེའི་སྐྱབས་སུ་དོང་སྟེ། ཆོས་མཉན་པའི་ཕྱིར་དེའི་མདུན་ན་འཁོད་དོ།
en: “We weren’t able to harm even a single pore of the skin of that monk Gautama, let alone kill him. And furthermore, twenty thousand of your children have taken refuge with him and are now sitting in front of him to hear the Dharma.”

source: །དེ་ནས་བདུད་སྡིག་ཅན་རབ་ཏུ་ཁྲོས་ཏེ་སྡུག་བསྔལ་ཞིང་ཡིད་མི་བདེ་ནས་ཡིད་ལ་གཅགས་ཏེ་དེས་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཤཱཀྱའི་བུ་ནི་ཇི་སྲིད་བརླག་པར་མ་བྱས་པ།
en: The evil Māra , enraged, unhappy, dejected, and even more sullen, lamented:

source: །དེ་སྲིད་བར་དུ་ང་ཡི་དབལ་སོང་སླར་མི་འོང་།
en: “My good fortune has left me and will not return Until we bring ruin upon this son of the Śākyas. Silent we stand with this sole problem in our minds:

source: །ཤཱཀྱའི་བུ་འདི་ཇི་ལྟར་དེ་རིང་བསད་སྙམ་སྟེ།
en: ‘How can we kill the son of the Śākyas?’ ”

source: །བདག་ཅག་གཞན་ལ་ཡིད་མི་རྟོག་ཅིང་མི་སྨྲ་འདུག །དེ་ནས་བདུད་སྡིག་ཅན་ཡིད་མི་བདེ་ཞིང་མྱ་ངན་གྱི་ཁང་པ་ན་འདུག་གོ།
en: Then Māra , the evil one, sat down, sinking into despondency.

source: །འདུས་པ་ཆེན་པོ་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་ལས། བདུད་སྤ་བཀོང་བའི་ལེའུ་སྟེ་དང་པོའོ།།
en: Here ends the first chapter, “The Intimidation of Māra,” from the Mahāyāna sūtra “Ratnaketu.”

source: །།བམ་པོ་གཉིས་པ།
en: Chapter

source: དེ་ནས་བདུད་ཀྱི་བུ་མོ་དང་། བདུད་ཀྱི་བུ་ཕོ་ཚོགས་ཀྱི་འཁོར་དང་བཅས་པ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The daughters and sons of Māra , accompanied by their retinues, said to the Blessed One, “The extent to which the Thus-Gone One is endowed with means and wisdom is incredible!

source: །བཅོམ་ལྡན་འདས་བདག་ཅག་ནི་འདི་ལྟ་བུའི་ཐེག་པ་དང་། ཡེ་ཤེས་དང་། རྫུ་འཕྲུལ་དང་། སྙིང་རྗེ་དང་། ཐབས་དང་། སྤོབས་པ་འཚལ་ལོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཐབས་དང་ཡེ་ཤེས་ཀྱི་བར་དུ་ལྡན་པ་ངོ་མཚར་ཏོ།
en: We seek, O Blessed One, the same sort of Dharma vehicle, wisdom, magical powers, compassion, means, and eloquence.

source: །བཅོམ་ལྡན་འདས་ཆོས་དུ་དང་ལྡན་ན་སྐྱེས་བུ་གང་ཟག་སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་མི་མཆི་ཞིང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ།
en: What are the qualities, O Blessed One, that a person should have in order to not fall into the hands of evil companions, but instead swiftly realize unsurpassed and perfect awakening?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དག་ཆོས་བཞི་དང་ལྡན་ན་འདི་ལ་སྐྱེས་བུ་གང་ཟག་ལ་ལ་སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་མི་འགྲོ་ཞིང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: “O noble sons and daughters,” replied the Blessed One, “should any person in this world be endowed with four qualities, they will not fall into the hands of evil companions, but instead swiftly realize unsurpassed and perfect awakening.

source: །བཞི་གང་ཞེ་ན།
en: What are these four?

source: བཞིན་བཟངས་དག་འདི་ལ་རིགས་ཀྱི་བུ་ཆོས་ཐམས་ཅད་ལ་མཆོག་ཏུ་མི་འཛིན་ཅིང་། ཆོས་གང་ཡང་མི་འཛིན། མི་གཏོང་། ཁས་མི་ལེན།
en: “My friends, a noble son or daughter must not be attached to any phenomenon.

source: མི་གནས། ཉེ་བར་མི་ལེན། མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ། །འདི་ལྟ་སྟེ། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན་སྦྱིན་པའི་འབྲས་བུ་ཡང་མི་གཏོང་།
en: They must never grasp, hold on to, dwell upon, conceptualize, or falsely identify any phenomenon, so that when they are training in the perfection of generosity, they neither reject nor grasp at the fruit of generosity, hold on to it, dwell upon it, conceptualize it, nor falsely identify it. up to not conceptualizing or falsely identifying when practicing the perfection of insight.

source: ཉེ་བར་མི་ལེན། མི་གནས། མི་རྟོག་རྣམ་པར་མི་རྟོག་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་དུ་སྤྱོད་པ་ན་མི་རྟོག་རྣམ་པར་མི་རྟོག་པའི་བར་དུའོ། །བཞིན་བཟངས་དག་གཞན་ཡང་རིགས་ཀྱི་བུ་དེ་སེམས་ཅན་དུ་སྨྲ་བ་མ་ཡིན།
en: “Another quality, my friends, is that a noble son or daughter must not profess the independent existence of beings, the vital principle, an individual soul, or personhood, must not be attached in their minds . . . and must not conceptualize or falsely identify the realm of beings.
